Revit 2027 API
ScheduleField.SetStyle Method
 Sets the style of this field.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetStyle(
	TableCellStyle style
)
Public Sub SetStyle (
	style As TableCellStyle
)
public:
void SetStyle(
	TableCellStyle^ style
)
member SetStyle :
        style : TableCellStyle -> unit
Parameters
style TableCellStyle
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ScheduleField Class
Autodesk.Revit.DB Namespace